<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"63b5c8c219b80e8fb7cec274830abb719418dfd0c9a4d222f4699f3db757440c","plan_job_ref":"Job Test plan target and replace #323 at https://github.com/dflook/terraform-github-actions/actions/runs/4295435982","plan_hash":"319de303c03bf168aedc2dee9910c563658acf244a2c287c9752f55a30c75a92","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "KAi6K6KfmW" -> (known after apply)
  ~ foreach = "Wh4Q0o3V6Q" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #323](https://github.com/dflook/terraform-github-actions/actions/runs/4295435982)